zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cz_ca/pic32cz_ca80/pic32cz4010ca80176-pinctrl.h
/* pd20m_gclk_io6 */
#define PD20M_GCLK_IO6 MCHP_PINMUX(d, 20, m, periph)

/* pd21_gpio */
#define PD21_GPIO MCHP_PINMUX(d, 21, gpio, gpio)

/* pd21a_eic_extint6 */
#define PD21A_EIC_EXTINT6 MCHP_PINMUX(d, 21, a, periph)

/* pd21e_ebi_d14 */
#define PD21E_EBI_D14 MCHP_PINMUX(d, 21, e, periph)

/* pd21k_eth_grx5 */
#define PD21K_ETH_GRX5 MCHP_PINMUX(d, 21, k, periph)

/* pd21m_gclk_io7 */
#define PD21M_GCLK_IO7 MCHP_PINMUX(d, 21, m, periph)

/* pd23_gpio */
#define PD23_GPIO MCHP_PINMUX(d, 23, gpio, gpio)

/* pd23a_eic_extint7 */
#define PD23A_EIC_EXTINT7 MCHP_PINMUX(d, 23, a, periph)

/* pd23e_ebi_d1 */
#define PD23E_EBI_D1 MCHP_PINMUX(d, 23, e, periph)

/* pd23f_tcc8_wo1 */
#define PD23F_TCC8_WO1 MCHP_PINMUX(d, 23, f, periph)

/* pd23h_can5_rx */
#define PD23H_CAN5_RX MCHP_PINMUX(d, 23, h, periph)

/* pe0_gpio */
#define PE0_GPIO MCHP_PINMUX(e, 0, gpio, gpio)

/* pe0a_eic_extint0 */
#define PE0A_EIC_EXTINT0 MCHP_PINMUX(e, 0, a, periph)

/* pe0j_spi_ixs1_sdo */
#define PE0J_SPI_IXS1_SDO MCHP_PINMUX(e, 0, j, periph)

/* pe1_gpio */
#define PE1_GPIO MCHP_PINMUX(e, 1, gpio, gpio)

/* pe1a_eic_extint1 */
#define PE1A_EIC_EXTINT1 MCHP_PINMUX(e, 1, a, periph)

/* pe1j_spi_ixs1_sck */
#define PE1J_SPI_IXS1_SCK MCHP_PINMUX(e, 1, j, periph)

/* pe2_gpio */
#define PE2_GPIO MCHP_PINMUX(e, 2, gpio, gpio)

/* pe2a_eic_extint2 */
#define PE2A_EIC_EXTINT2 MCHP_PINMUX(e, 2, a, periph)

/* pe2j_spi_ixs1_sdi */
#define PE2J_SPI_IXS1_SDI MCHP_PINMUX(e, 2, j, periph)

/* pe3_gpio */
#define PE3_GPIO MCHP_PINMUX(e, 3, gpio, gpio)

/* pe3a_eic_extint3 */
#define PE3A_EIC_EXTINT3 MCHP_PINMUX(e, 3, a, periph)

/* pe3b_adc0_ain9 */
#define PE3B_ADC0_AIN9 MCHP_PINMUX(e, 3, b, periph)

/* pf5_gpio */
#define PF5_GPIO MCHP_PINMUX(f, 5, gpio, gpio)

/* pf5a_eic_extint5 */
#define PF5A_EIC_EXTINT5 MCHP_PINMUX(f, 5, a, periph)

/* pf5p_ptc_drv21 */
#define PF5P_PTC_DRV21 MCHP_PINMUX(f, 5, p, periph)

/* pg0_gpio */
#define PG0_GPIO MCHP_PINMUX(g, 0, gpio, gpio)

/* pg0a_eic_extint0 */
#define PG0A_EIC_EXTINT0 MCHP_PINMUX(g, 0, a, periph)

/* pg0d_sercom6_pad2 */
#define PG0D_SERCOM6_PAD2 MCHP_PINMUX(g, 0, d, periph)

/* pg0e_ebi_a17 */
#define PG0E_EBI_A17 MCHP_PINMUX(g, 0, e, periph)

/* pg0h_sqi1_data1 */
#define PG0H_SQI1_DATA1 MCHP_PINMUX(g, 0, h, periph)

/* pg0i_sdmmc1_sddat1 */
#define PG0I_SDMMC1_SDDAT1 MCHP_PINMUX(g, 0, i, periph)

/* pg1_gpio */
#define PG1_GPIO MCHP_PINMUX(g, 1, gpio, gpio)

/* pg1a_eic_extint1 */
#define PG1A_EIC_EXTINT1 MCHP_PINMUX(g, 1, a, periph)

/* pg1d_sercom6_pad3 */
#define PG1D_SERCOM6_PAD3 MCHP_PINMUX(g, 1, d, periph)

/* pg1e_ebi_a16 */
#define PG1E_EBI_A16 MCHP_PINMUX(g, 1, e, periph)

/* pg1h_sqi1_data2 */
#define PG1H_SQI1_DATA2 MCHP_PINMUX(g, 1, h, periph)

/* pg1i_sdmmc1_sddat2 */
#define PG1I_SDMMC1_SDDAT2 MCHP_PINMUX(g, 1, i, periph)

/* pg2_gpio */
#define PG2_GPIO MCHP_PINMUX(g, 2, gpio, gpio)

/* pg2a_eic_extint2 */
#define PG2A_EIC_EXTINT2 MCHP_PINMUX(g, 2, a, periph)

/* pg2e_ebi_a15 */
#define PG2E_EBI_A15 MCHP_PINMUX(g, 2, e, periph)

/* pg2h_sqi1_data3 */
#define PG2H_SQI1_DATA3 MCHP_PINMUX(g, 2, h, periph)

/* pg2i_sdmmc1_sddat3 */
#define PG2I_SDMMC1_SDDAT3 MCHP_PINMUX(g, 2, i, periph)

/* pg3_gpio */
#define PG3_GPIO MCHP_PINMUX(g, 3, gpio, gpio)

/* pg3a_eic_extint3 */
#define PG3A_EIC_EXTINT3 MCHP_PINMUX(g, 3, a, periph)

/* pg3e_ebi_a11 */
#define PG3E_EBI_A11 MCHP_PINMUX(g, 3, e, periph)

/* pg3h_sqi1_cs0 */
#define PG3H_SQI1_CS0 MCHP_PINMUX(g, 3, h, periph)

/* pg3i_sdmmc1_sdcmd */
#define PG3I_SDMMC1_SDCMD MCHP_PINMUX(g, 3, i, periph)

#endif /* MICROCHIP_PIC32CZ4010CA80176_PINCTRL_H_ */
